import pandas as pd
import matplotlib.pyplot as plt

data = {
    "Місяць": [
        "Січень", "Лютий", "Березень", "Квітень", "Травень", "Червень",
        "Липень", "Серпень", "Вересень", "Жовтень", "Листопад", "Грудень"
    ],
    "Кількість користувачів": [3100, 2900, 4600, 10000, 14000, 15700, 16500, 16000, 14500, 11200, 6100, 3800]
}

df = pd.DataFrame(data)

print("Використання велодоріжок за 2017 рік:")
print(df)

max_month = df.loc[df["Кількість користувачів"].idxmax()]

print(f"\nНайпопулярніший місяць: {max_month['Місяць']}")
print(f"Кількість користувачів: {max_month['Кількість користувачів']}")

plt.figure(figsize=(8, 8))
plt.pie(df["Кількість користувачів"], labels=df["Місяць"], autopct='%1.1f%%', startangle=90)
plt.title("Розподіл використання велодоріжок за місяцями (2017 рік)")
plt.axis("equal")  
plt.show()
